test_result/fio-3.28-4R5J0001-sr-1G-qd64-num1-128K-3000-WT.txt
fio-3.28-4R5J0001-read-1G-64-1-128K: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685887,
  "timestamp_ms" : 1750685887514,
  "time" : "Mon Jun 23 21:38:07 2025",
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-read-1G-64-1-128K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-read-1G-64-1-128K",
        "filename" : "/dev/sda",
        "rw" : "read",
        "bs" : "128K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "64",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 1126696562,
        "bw" : 1100289,
        "iops" : 8596.012592,
        "runtime" : 953,
        "total_ios" : 8192,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 7631,
          "max" : 83988,
          "mean" : 30948.078979,
          "stddev" : 15570.776226,
          "N" : 8192
        },
        "clat_ns" : {
          "min" : 2081708,
          "max" : 14510203,
          "mean" : 7389327.420410,
          "stddev" : 549367.660365,
          "N" : 8192,
          "percentile" : {
            "1.000000" : 6258688,
            "5.000000" : 7241728,
            "10.000000" : 7307264,
            "20.000000" : 7307264,
            "30.000000" : 7372800,
            "40.000000" : 7372800,
            "50.000000" : 7438336,
            "60.000000" : 7438336,
            "70.000000" : 7438336,
            "80.000000" : 7503872,
            "90.000000" : 7503872,
            "95.000000" : 7569408,
            "99.000000" : 7569408,
            "99.500000" : 9764864,
            "99.900000" : 13565952,
            "99.950000" : 14090240,
            "99.990000" : 14483456
          },
          "bins" : {
            "2088960" : 1,
            "2113536" : 1,
            "2146304" : 1,
            "2211840" : 3,
            "2244608" : 1,
            "2277376" : 2,
            "2310144" : 1,
            "2342912" : 1,
            "2375680" : 1,
            "2408448" : 2,
            "2473984" : 1,
            "2506752" : 2,
            "2539520" : 1,
            "2605056" : 1,
            "2637824" : 2,
            "2670592" : 2,
            "2736128" : 1,
            "2768896" : 3,
            "2801664" : 1,
            "2867200" : 1,
            "2899968" : 3,
            "2932736" : 1,
            "2965504" : 1,
            "2998272" : 1,
            "3031040" : 2,
            "3063808" : 1,
            "3096576" : 1,
            "3129344" : 2,
            "3194880" : 1,
            "3227648" : 2,
            "3260416" : 2,
            "3293184" : 1,
            "3325952" : 1,
            "3358720" : 1,
            "3424256" : 1,
            "3457024" : 1,
            "3522560" : 1,
            "3588096" : 1,
            "3653632" : 1,
            "3719168" : 1,
            "3784704" : 1,
            "3850240" : 1,
            "3915776" : 1,
            "3981312" : 1,
            "4046848" : 1,
            "4112384" : 1,
            "4177920" : 1,
            "4227072" : 1,
            "4292608" : 1,
            "4423680" : 1,
            "4489216" : 1,
            "4554752" : 1,
            "4685824" : 1,
            "4751360" : 1,
            "4882432" : 1,
            "5079040" : 1,
            "5210112" : 1,
            "5275648" : 1,
            "5341184" : 1,
            "5472256" : 1,
            "5603328" : 1,
            "5668864" : 1,
            "5799936" : 1,
            "5931008" : 1,
            "5996544" : 1,
            "6127616" : 1,
            "6258688" : 1,
            "6324224" : 1,
            "6455296" : 2,
            "6651904" : 1,
            "6782976" : 1,
            "6848512" : 1,
            "6979584" : 1,
            "7110656" : 1,
            "7176192" : 49,
            "7241728" : 461,
            "7307264" : 1569,
            "7372800" : 1925,
            "7438336" : 2176,
            "7503872" : 1428,
            "7569408" : 428,
            "7634944" : 6,
            "7766016" : 2,
            "7962624" : 1,
            "8093696" : 1,
            "8159232" : 1,
            "8224768" : 1,
            "8290304" : 1,
            "8454144" : 2,
            "8716288" : 1,
            "8847360" : 2,
            "9109504" : 1,
            "9240576" : 2,
            "9502720" : 3,
            "9764864" : 2,
            "10027008" : 2,
            "10158080" : 1,
            "10289152" : 2,
            "10551296" : 1,
            "10682368" : 2,
            "10944512" : 1,
            "11075584" : 2,
            "11337728" : 2,
            "11468800" : 1,
            "11730944" : 2,
            "11862016" : 1,
            "11993088" : 1,
            "12124160" : 1,
            "12255232" : 2,
            "12517376" : 2,
            "12648448" : 1,
            "12910592" : 3,
            "13172736" : 1,
            "13303808" : 2,
            "13565952" : 3,
            "13828096" : 2,
            "14090240" : 1,
            "14221312" : 2,
            "14483456" : 2
          }
        },
        "lat_ns" : {
          "min" : 2142160,
          "max" : 14532831,
          "mean" : 7420722.461182,
          "stddev" : 546933.064086,
          "N" : 8192
        },
        "bw_min" : 1102848,
        "bw_max" : 1102848,
        "bw_agg" : 100.000000,
        "bw_mean" : 1102848.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 1,
        "iops_min" : 8616,
        "iops_max" : 8616,
        "iops_mean" : 8616.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 1
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 952,
      "usr_cpu" : 3.676471,
      "sys_cpu" : 35.294118,
      "ctx" : 4827,
      "majf" : 0,
      "minf" : 2059,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.195312,
        "32" : 0.390625,
        ">=64" : 99.230957
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.987700,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.100000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.720215,
        "10" : 98.803711,
        "20" : 0.476074,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 64,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 7599,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 55637,
      "write_ticks" : 0,
      "in_queue" : 55637,
      "util" : 90.335707
    }
  ]
}

fio-3.28-4R5J0001-read-1G-64-1-128K: (groupid=0, jobs=1): err= 0: pid=83295: Mon Jun 23 21:38:07 2025
  read: IOPS=8596, BW=1075MiB/s (1127MB/s)(1024MiB/953msec)
    slat (nsec): min=7631, max=83988, avg=30948.08, stdev=15570.78
    clat (usec): min=2081, max=14510, avg=7389.33, stdev=549.37
     lat (usec): min=2142, max=14532, avg=7420.72, stdev=546.93
    clat percentiles (usec):
     |  1.00th=[ 6259],  5.00th=[ 7242], 10.00th=[ 7308], 20.00th=[ 7308],
     | 30.00th=[ 7373], 40.00th=[ 7373], 50.00th=[ 7439], 60.00th=[ 7439],
     | 70.00th=[ 7439], 80.00th=[ 7504], 90.00th=[ 7504], 95.00th=[ 7570],
     | 99.00th=[ 7570], 99.50th=[ 9765], 99.90th=[13566], 99.95th=[14091],
     | 99.99th=[14484]
   bw (  MiB/s): min= 1077, max= 1077, per=100.00%, avg=1077.00, stdev= 0.00, samples=1
   iops        : min= 8616, max= 8616, avg=8616.00, stdev= 0.00, samples=1
  lat (msec)   : 4=0.72%, 10=98.80%, 20=0.48%
  cpu          : usr=3.68%, sys=35.29%, ctx=4827, majf=0, minf=2059
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=0.4%, >=64=99.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=8192,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=1075MiB/s (1127MB/s), 1075MiB/s-1075MiB/s (1127MB/s-1127MB/s), io=1024MiB (1074MB), run=953-953msec

Disk stats (read/write):
  sda: ios=7599/0, merge=0/0, ticks=55637/0, in_queue=55637, util=90.34%